[Killed] LogicalOperator
src/index.ts:7:9
 }
 
 export function calculateRisk(patientData: PatientData): string {
-    if (patientData.age >= 60 || patientData.bmi >= 30) {
+    if (patientData.age >= 60 && patientData.bmi >= 30) {
         return 'High';
     } else {
killedBy: calculateRisk should return "Low" for a patient aged 1 with BMI 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "High"
Received: "Low"

[Killed] EqualityOperator
src/index.ts:7:34
 }
 
 export function calculateRisk(patientData: PatientData): string {
-    if (patientData.age >= 60 || patientData.bmi >= 30) {
+    if (patientData.age >= 60 || patientData.bmi < 30) {
         return 'High';
     } else {
killedBy: calculateRisk should return "Low" for a patient aged 1 with BMI 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "High"
Received: "Low"
