[Killed] ArithmeticOperator
src/index.ts:3:25
 
 export function calculateBMI(weight: number, height: number): string {
-    const bmi: number = weight / (height * height);
+    const bmi: number = weight * (height * height);
     if (bmi < 18.5) {
         return 'Underweight';
killedBy: calculateBMI should return "Underweight" for a person with weight 50kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: "Obesity"

[Killed] ArithmeticOperator
src/index.ts:3:35
 
 export function calculateBMI(weight: number, height: number): string {
-    const bmi: number = weight / (height * height);
+    const bmi: number = weight / (height / height);
     if (bmi < 18.5) {
         return 'Underweight';
killedBy: calculateBMI should return "Underweight" for a person with weight 50kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: "Obesity"

[Killed] EqualityOperator
src/index.ts:4:9
 
 export function calculateBMI(weight: number, height: number): string {
     const bmi: number = weight / (height * height);
-    if (bmi < 18.5) {
+    if (bmi >= 18.5) {
         return 'Underweight';
     } else if (bmi < 24.9) {
killedBy: calculateBMI should return "Underweight" for a person with weight 50kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: "Normal weight"

[Killed] ConditionalExpression
src/index.ts:4:9
 
 export function calculateBMI(weight: number, height: number): string {
     const bmi: number = weight / (height * height);
-    if (bmi < 18.5) {
+    if (true) {
         return 'Underweight';
     } else if (bmi < 24.9) {
killedBy: calculateBMI should return "Normal weight" for a person with weight 70kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: "Underweight"

[Killed] EqualityOperator
src/index.ts:6:16
     const bmi: number = weight / (height * height);
     if (bmi < 18.5) {
         return 'Underweight';
-    } else if (bmi < 24.9) {
+    } else if (bmi >= 24.9) {
         return 'Normal weight';
     } else if (bmi < 29.9) {
killedBy: calculateBMI should return "Normal weight" for a person with weight 70kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: "Overweight"

[Killed] ConditionalExpression
src/index.ts:6:16
     const bmi: number = weight / (height * height);
     if (bmi < 18.5) {
         return 'Underweight';
-    } else if (bmi < 24.9) {
+    } else if (true) {
         return 'Normal weight';
     } else if (bmi < 29.9) {
killedBy: calculateBMI should return "Overweight" for a person with weight 90kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Overweight"
Received: "Normal weight"

[Killed] StringLiteral
src/index.ts:7:16
     if (bmi < 18.5) {
         return 'Underweight';
     } else if (bmi < 24.9) {
-        return 'Normal weight';
+        return "";
     } else if (bmi < 29.9) {
         return 'Overweight';
killedBy: calculateBMI should return "Normal weight" for a person with weight 70kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: ""

[Killed] ConditionalExpression
src/index.ts:8:16
         return 'Underweight';
     } else if (bmi < 24.9) {
         return 'Normal weight';
-    } else if (bmi < 29.9) {
+    } else if (true) {
         return 'Overweight';
     } else {
killedBy: calculateBMI should return "Obesity" for a person with weight 140kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Obesity"
Received: "Overweight"

[Killed] EqualityOperator
src/index.ts:8:16
         return 'Underweight';
     } else if (bmi < 24.9) {
         return 'Normal weight';
-    } else if (bmi < 29.9) {
+    } else if (bmi >= 29.9) {
         return 'Overweight';
     } else {
killedBy: calculateBMI should return "Overweight" for a person with weight 90kg and height 1.75m
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Overweight"
Received: "Obesity"
